import json


all_games = {}

c = 3 # multipier

# 以每个阶段100

# pubg like

# MOBA
all_games["王者荣耀"] = {
    "1_0登陆游戏-开始游戏": 16*c,
    "1_1广告弹窗-关闭": 6*c,
    "1_2游戏更新弹窗_关闭": 25*c,
    "1_3礼物获取_确定": 25*c,
    "2游戏大厅界面-下方对战": 16*c,
    "3对战模式-5v5王者峡谷": 16*c,
    "4_5v5模式下-人机": 16*c,
    "5标准模式难度1-开始练习": 16*c,
    "6_5v5组队-开始游戏": 16*c,
    "7匹配中": 25*c,
    "8匹配成功-确认": 16*c,
    "9英雄选择-可不操作": 16*c,
    "10游戏中": 1*c,
    "11游戏结束-胜利-点击屏幕继续": 25*c,
    "11游戏结束-失败-点击屏幕继续": 25*c,
    "12团队表现-点击此处继续": 20*c,
    "13个人本局表现-点击此处继续": 20*c,
    "14_0战绩结算-返回房间": 20*c,
    "14_1荣耀战令-确定": 25*c,
    "14_2翻页广告-我知道啦": 25*c,
    "游戏加载": 6*c,
}

with open("all_game_config_1028.json", "w", encoding="utf-8") as f:
    json.dump(all_games, f, ensure_ascii=False, indent=4)

